{
  "meta": {
    "id": "iei_premium_15x2_v1",
    "version": "1.0.0",
    "audience": "usuario",
    "language": "es",
    "scale": "0-100",
    "property_types": ["vivienda", "comercio"],
    "ui_rules": {
      "allow_unknown_option": true,
      "unknown_key": "U",
      "unknown_default_score_key": "2",
      "unknown_note": "Si el usuario no sabe, puede marcar 'No lo sé'. El sistema lo puntúa como riesgo medio-alto (0.66) y aumenta la incertidumbre."
    }
  },
  "mapping": {
    "score_map": {
      "0": 0.0,
      "1": 0.33,
      "2": 0.66,
      "3": 1.0,
      "U": 0.66
    }
  },
  "blocks": {
    "S": "Segmento_tipo",
    "E": "Exposicion_entorno",
    "R": "Resistencia_fisica",
    "D": "Deteccion_cobertura",
    "P": "Respuesta_disuasion",
    "H": "Habitos_control",
    "T": "Atractivo_objetivo"
  },
  "tooltips": {
    "CRA": "Central Receptora de Alarmas: verifica el salto de alarma y avisa (policía/propietario/seguridad) según protocolo.",
    "Perimetral": "Sensores en puertas/ventanas antes de que entren. Reduce oportunidad y tiempo de exposición.",
    "CCTV_util": "Cámara que graba, permite revisión y cubre entradas/zonas críticas sin grandes puntos ciegos.",
    "Cierre_robusto": "Cerradura/cilindro moderno + escudo/protección + ajuste de marco. En comercio: persiana metálica o cierre equivalente.",
    "Puntos_ciegos": "Zonas donde se puede acercar/actuar sin ser visto desde calle/vecinos/cámaras."
  },

  "questions_common": [],

  "questions_vivienda": [
    {
      "id": "V01",
      "block": "S",
      "text": "¿Qué tipo de vivienda quieres evaluar?",
      "help": "La tipología cambia exposición y facilidad de acceso (bajo/ático/casa).",
      "options": [
        { "key": "0", "label": "Piso alto (3º o superior), sin terraza accesible desde fuera" },
        { "key": "1", "label": "Piso intermedio (1º–2º) o en edificio con accesos controlados" },
        { "key": "2", "label": "Planta baja o vivienda con patio/terraza accesible desde el exterior" },
        { "key": "3", "label": "Casa, chalet o adosado con accesos alrededor de la vivienda" },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V02",
      "block": "E",
      "text": "¿Es fácil que alguien se acerque a tu vivienda sin que nadie lo note?",
      "help": "A más puntos ciegos y menor vigilancia natural, más oportunidad de intrusión.",
      "options": [
        { "key": "0", "label": "Difícil: Se ve desde la calle y/o vecinos; casi no hay puntos ciegos." },
        { "key": "1", "label": "Algo fácil: Hay algún punto ciego, pero en general se ve bastante" },
        { "key": "2", "label": "Fácil: Hay varios puntos ciegos o se puede llegar sin llamar la atención." },
        { "key": "3", "label": "Muy fácil: Se puede acercar sin ser visto; poca visibilidad y pocos ojos alrededor." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V03",
      "block": "E",
      "text": "Por la noche, ¿la entrada de tu vivienda está bien iluminada?",
      "help": "La falta de luz aumenta tiempo de maniobra y reduce detección por terceros.",
      "options": [
        { "key": "0", "label": "Muy bien iluminada: No hay zonas oscuras y se ve claramente el acceso." },
        { "key": "1", "label": "Bien iluminada: Lo esencial se ve, aunque hay algún rincón menos visible." },
        { "key": "2", "label": "Regular: Hay varias zonas oscuras o con poca luz." },
        { "key": "3", "label": "Mal iluminada: Apenas hay luz o el acceso queda en sombra." },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "V04",
      "block": "R",
      "text": "¿Qué tan segura dirías que es tu puerta principal?",
      "help": "Evalúa resistencia real (marco, cerradura, cilindro, escudo).",
      "options": [
        { "key": "0", "label": "Muy segura: Puerta acorazada o de alta seguridad, bien instalada y sin holguras." },
        { "key": "1", "label": "Bastante segura: Puerta blindada o reforzada, con algún punto mejorable." },
        { "key": "2", "label": "Seguridad básica: Puerta estándar, sin refuerzos adicionales." },
        { "key": "3", "label": "Poco segura: Puerta antigua o débil, con holguras o cerradura vulnerable." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V05",
      "block": "R",
      "text": "Las ventanas a las que se puede acceder desde fuera, ¿qué nivel de protección tienen?",
      "help": "Muchos robos entran por el punto menos protegido.",
      "options": [
        { "key": "0", "label": "Muy protegidas: Tienen rejas, cierres de seguridad o persianas robustas." },
        { "key": "1", "label": "Bastante protegidas: La mayoría tiene alguna medida de refuerzo." },
        { "key": "2", "label": "Poco protegidas: Varias se podrían forzar con relativa facilidad." },
        { "key": "3", "label": "Sin protección real: Son fácilmente accesibles y sin medidas adicionales." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V06",
      "block": "R",
      "text": "Los accesos secundarios (patio, terraza, garaje, trastero…), ¿qué nivel de seguridad tienen?",
      "help": "El acceso secundario suele ser el punto de entrada real.",
      "options": [
        { "key": "0", "label": "Muy seguros: Cerraduras robustas y buen control de acceso." },
        { "key": "1", "label": "Bastante seguros: Tienen medidas razonables, aunque podrían mejorarse." },
        { "key": "2", "label": "Poco seguros: Cierres básicos o zonas fáciles de acceder." },
        { "key": "3", "label": "Muy vulnerables: Prácticamente sin protección o fácil acceso." },
        { "key": "U", "label": "No lo sé / No hay" }
      ]
    },

    {
      "id": "V07",
      "block": "D",
      "text": "Si alguien intentara entrar, ¿lo sabrías casi de inmediato?",
      "help": "Importa detección real y rapidez de aviso (ideal: perimetral/entradas + CRA o móvil).",
      "options": [
        { "key": "0", "label": "Sí, casi seguro: Sensores bien instalados y aviso inmediato (central o móvil)." },
        { "key": "1", "label": "Probablemente: Sistema funcional, aunque no cubre todo." },
        { "key": "2", "label": "Dudoso: Sistema básico o posible retraso en el aviso." },
        { "key": "3", "label": "No: No hay detección rápida o no existe sistema fiable." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V08",
      "block": "D",
      "text": "Las entradas y zonas importantes de tu vivienda, ¿están bien cubiertas por sensores o cámaras?",
      "help": "Sensores y/o CCTV útil (CCTV_util) sin puntos ciegos relevantes.",
      "options": [
        { "key": "0", "label": "Muy bien cubiertas: Entradas y zonas clave sin puntos ciegos relevantes." },
        { "key": "1", "label": "Bien cubiertas: La mayoría está protegida, aunque alguna zona podría mejorar." },
        { "key": "2", "label": "Regular: Hay puntos ciegos importantes." },
        { "key": "3", "label": "Mal cubiertas o sin sistema: Muchas zonas sin cubrir o no hay medios útiles." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V09",
      "block": "D",
      "text": "Desde fuera, ¿se percibe que tu vivienda tiene medidas de seguridad?",
      "help": "La disuasión real reduce selección del objetivo.",
      "options": [
        { "key": "0", "label": "Sí, claramente: Se ven elementos disuasorios reales (placa, cámaras visibles, refuerzos, etc.)." },
        { "key": "1", "label": "Sí, algo se percibe: Hay alguna señal o elemento visible." },
        { "key": "2", "label": "Apenas se percibe: Desde fuera casi no se nota seguridad." },
        { "key": "3", "label": "No se percibe nada: Parece una vivienda sin medidas visibles." },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "V10",
      "block": "P",
      "text": "Si alguien entrara en tu vivienda, ¿en cuánto tiempo habría una reacción real?",
      "help": "Los primeros 5–10 minutos suelen decidir el resultado.",
      "options": [
        { "key": "0", "label": "En menos de 10 minutos." },
        { "key": "1", "label": "Entre 10 y 20 minutos." },
        { "key": "2", "label": "Entre 20 y 40 minutos." },
        { "key": "3", "label": "Más de 40 minutos o probablemente nadie a tiempo." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V11",
      "block": "P",
      "text": "¿Tu vivienda cuenta con algún sistema de alarma o aviso ante intrusión?",
      "help": "CRA suele acelerar verificación y aviso; móvil depende de disponibilidad del usuario.",
      "options": [
        { "key": "0", "label": "Sí, conectada a una central receptora (CRA) con verificación." },
        { "key": "1", "label": "Sí, conectada a central pero con verificación limitada." },
        { "key": "2", "label": "Sí, solo aviso al móvil." },
        { "key": "3", "label": "No tengo ningún sistema de alarma." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V12",
      "block": "P",
      "text": "Cuando se activa una alerta, ¿se puede comprobar lo que ocurre antes de intervenir?",
      "help": "Verificación reduce falsas alarmas y acelera respuesta real.",
      "options": [
        { "key": "0", "label": "Sí, verificación completa (cámaras y/o audio con protocolo profesional)." },
        { "key": "1", "label": "Sí, verificación parcial (cámara o llamada)." },
        { "key": "2", "label": "Limitada: depende del usuario o no siempre es posible comprobarlo." },
        { "key": "3", "label": "No hay verificación" },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "V13",
      "block": "H",
      "text": "Desde fuera, ¿es fácil saber cuándo tu vivienda está vacía?",
      "help": "Rutinas previsibles + señales externas facilitan elegir el momento.",
      "options": [
        { "key": "0", "label": "No: Los horarios son variables o tomo medidas para que no se note." },
        { "key": "1", "label": "A veces: Hay alguna rutina visible, pero no es evidente." },
        { "key": "2", "label": "Sí: Las ausencias suelen ser predecibles." },
        { "key": "3", "label": "Sí, claramente: Se nota con frecuencia cuándo no hay nadie." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V14",
      "block": "H",
      "text": "¿Tienes bien controladas las llaves y códigos de acceso a tu vivienda?",
      "help": "Incluye copias, códigos compartidos, terceros con acceso histórico, etc.",
      "options": [
        { "key": "0", "label": "Sí, totalmente: Solo pocas personas autorizadas y control claro de copias." },
        { "key": "1", "label": "Bastante controlado: Algunas personas tienen acceso, pero lo tengo localizado." },
        { "key": "2", "label": "Poco controlado: Hay varias copias o códigos compartidos sin seguimiento claro." },
        { "key": "3", "label": "Descontrolado: Muchas llaves o códigos circulando y sin trazabilidad." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "V15",
      "block": "T",
      "text": "Desde fuera, ¿tu vivienda podría parecer un objetivo fácil o atractivo?",
      "help": "No es el valor real: es lo que se percibe desde fuera (facilidad + discreción + señales).",
      "options": [
        { "key": "0", "label": "Poco probable: No parece fácil ni especialmente atractiva desde fuera." },
        { "key": "1", "label": "Algo probable: Podría llamar algo la atención, pero no destaca." },
        { "key": "2", "label": "Bastante probable: Parece accesible o con cierto valor visible." },
        { "key": "3", "label": "Muy probable: Accesos discretos, poca vigilancia y señales claras de valor." },
        { "key": "U", "label": "No lo sé" }
      ]
    }
  ],

  "questions_comercio": [
    {
      "id": "C01",
      "block": "S",
      "text": "¿Qué tipo de negocio es tu local?",
      "help": "El sector cambia el atractivo del objetivo y patrones de intrusión.",
      "options": [
        { "key": "0", "label": "Oficina o despacho profesional (poco valor visible)." },
        { "key": "1", "label": "Restaurante, clínica, centro estético o farmacia (valor medio)." },
        { "key": "2", "label": "Tienda de moda o retail general (valor medio-alto)." },
        { "key": "3", "label": "Joyería, electrónica u otros productos de alto valor." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C02",
      "block": "T",
      "text": "Los productos que vendes, ¿son fáciles de revender y de alto valor?",
      "help": "Electrónica, móviles, herramientas caras, cosmética premium, joyería, etc.",
      "options": [
        { "key": "0", "label": "Bajo: Poco valor o difícil de revender." },
        { "key": "1", "label": "Medio: Valor moderado o parcialmente revendible." },
        { "key": "2", "label": "Alto: Bastante valor y fácil salida en mercado paralelo." },
        { "key": "3", "label": "Muy alto: Productos de alto valor y muy fáciles de revender." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C03",
      "block": "T",
      "text": "Desde la calle, ¿se perciben productos o elementos de valor en tu local?",
      "help": "Más valor visible = mayor selección del local como objetivo.",
      "options": [
        { "key": "0", "label": "No: El escaparate es discreto o no muestra valor evidente." },
        { "key": "1", "label": "Algo: Se percibe algo de valor, pero no de forma llamativa." },
        { "key": "2", "label": "Bastante: Se ven productos atractivos con facilidad." },
        { "key": "3", "label": "Mucho: Hay exposición clara de productos de alto valor." },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "C04",
      "block": "E",
      "text": "¿Es fácil acercarse a tu local y actuar sin que nadie lo note?",
      "help": "Más puntos ciegos y menos vigilancia natural elevan el riesgo.",
      "options": [
        { "key": "0", "label": "Difícil: Zona visible, con tránsito o vecinos atentos." },
        { "key": "1", "label": "Algo fácil: Hay algún punto ciego, pero en general se ve bastante." },
        { "key": "2", "label": "Fácil: Varios puntos poco visibles o zona discreta." },
        { "key": "3", "label": "Muy fácil: Se puede actuar sin ser visto; poca visibilidad y poco tránsito." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C05",
      "block": "E",
      "text": "Por la noche, ¿la fachada y la entrada de tu local están bien iluminadas?",
      "help": "Menos luz = más tiempo de maniobra y menor detección por terceros.",
      "options": [
        { "key": "0", "label": "Muy bien iluminadas: No hay zonas oscuras y el acceso se ve claramente." },
        { "key": "1", "label": "Bien iluminadas: Lo esencial se ve, aunque hay algún rincón en sombra." },
        { "key": "2", "label": "Mejorable: Varias zonas quedan con poca luz." },
        { "key": "3", "label": "Mal iluminadas: Hay poca luz o el acceso queda en sombra." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C06",
      "block": "E",
      "text": "Cuando cierras el local, ¿qué tan seguro es el cierre exterior (persiana o similar)?",
      "help": "En comercio, la barrera exterior cambia la dificultad de intrusión.",
      "options": [
        { "key": "0", "label": "Muy seguro: Persiana reforzada con buenos anclajes y sistema robusto." },
        { "key": "1", "label": "Bastante seguro: Buen cierre, aunque podría reforzarse." },
        { "key": "2", "label": "Básico: Persiana o cierre estándar, sin refuerzos especiales." },
        { "key": "3", "label": "Débil o inexistente: No hay cierre exterior sólido o es fácil de forzar." },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "C07",
      "block": "R",
      "text": "¿Qué tan segura dirías que es la puerta principal de tu local?",
      "help": "Resistencia real: marco, cerradura, cilindro, escudo (cierre_robusto).",
      "options": [
        { "key": "0", "label": "Muy segura: Puerta de alta seguridad, bien instalada y sin holguras." },
        { "key": "1", "label": "Bastante segura: Reforzada, aunque con algún punto mejorable." },
        { "key": "2", "label": "Seguridad básica: Puerta estándar sin refuerzos adicionales." },
        { "key": "3", "label": "Poco segura: Antigua, débil o mal ajustada." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C08",
      "block": "R",
      "text": "El cristal o escaparate de tu local, ¿qué nivel de resistencia tiene?",
      "help": "El cristal es un punto crítico en intrusión rápida.",
      "options": [
        { "key": "0", "label": "Alta seguridad: Cristal laminado o antirrobo real." },
        { "key": "1", "label": "Reforzado: Más resistente que uno estándar." },
        { "key": "2", "label": "Estándar: Cristal convencional sin refuerzo especial." },
        { "key": "3", "label": "Débil: Fácil de romper o sin protección adicional." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C09",
      "block": "R",
      "text": "Los accesos traseros o al almacén, ¿qué nivel de seguridad tienen?",
      "help": "El acceso trasero es un punto típico de intrusión.",
      "options": [
        { "key": "0", "label": "No hay acceso trasero o está completamente integrado y controlado." },
        { "key": "1", "label": "Bastante seguros: Protección razonable, aunque mejorable." },
        { "key": "2", "label": "Poco seguros: Cierres básicos o acceso relativamente fácil." },
        { "key": "3", "label": "Muy vulnerables: Sin protección real o acceso sencillo." },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "C10",
      "block": "H",
      "text": "¿Tienes bien controladas las llaves y códigos de acceso del local?",
      "help": "Rotación de personal, copias, códigos compartidos, accesos de proveedores.",
      "options": [
        { "key": "0", "label": "Sí, totalmente: Pocas personas y todo está controlado (copias y códigos)." },
        { "key": "1", "label": "Bastante controlado: Algunas personas tienen acceso, pero lo tengo localizado." },
        { "key": "2", "label": "Poco controlado: Varias llaves o códigos circulando sin seguimiento claro." },
        { "key": "3", "label": "Descontrolado: Muchos accesos/códigos compartidos y sin trazabilidad." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C11",
      "block": "H",
      "text": "Al cerrar el local, ¿seguís algún procedimiento para comprobar que todo queda bien asegurado?",
      "help": "El error humano al cierre es una puerta abierta (literalmente).",
      "options": [
        { "key": "0", "label": "Sí, formal y claro: Checklist definido y doble comprobación." },
        { "key": "1", "label": "Sí, básico: Hay una rutina, aunque no siempre se verifica todo." },
        { "key": "2", "label": "Informal: Depende de quién cierre ese día." },
        { "key": "3", "label": "No hay procedimiento fijo." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C12",
      "block": "H",
      "text": "¿Tu local pasa varios días seguidos cerrado o con aspecto de poca actividad?",
      "help": "El abandono aparente aumenta intrusiones y riesgo de ocupación/usurpación en algunos casos.",
      "options": [
        { "key": "0", "label": "No: Mantiene actividad regular y aspecto activo." },
        { "key": "1", "label": "Ocasionalmente: Algún cierre puntual, pero sin dar sensación de abandono." },
        { "key": "2", "label": "Con frecuencia: Cierres repetidos que pueden notarse." },
        { "key": "3", "label": "Sí, claramente: Pasa largas temporadas cerrado o parece abandonado." },
        { "key": "U", "label": "No lo sé" }
      ]
    },

    {
      "id": "C13",
      "block": "D",
      "text": "Si alguien intentara entrar en tu local, ¿lo sabrías casi de inmediato?",
      "help": "Ideal: sensores en accesos + aviso inmediato (CRA o móvil).",
      "options": [
        { "key": "0", "label": "Sí, casi seguro: Buena cobertura y aviso inmediato." },
        { "key": "1", "label": "Probablemente: Sistema funcional, aunque no cubre todo." },
        { "key": "2", "label": "Dudoso: Sistema básico o posible retraso en el aviso." },
        { "key": "3", "label": "No: No hay detección rápida o el sistema no es fiable." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C14",
      "block": "D",
      "text": "¿Las zonas más sensibles de tu local (entradas, caja, almacén) están bien cubiertas por cámaras o sensores?",
      "help": "Sensores y/o CCTV útil (CCTV_util) con cobertura real de zonas críticas.",
      "options": [
        { "key": "0", "label": "Muy bien cubiertas: Sin puntos ciegos importantes." },
        { "key": "1", "label": "Bien cubiertas: Alguna zona mejorable, pero protección razonable." },
        { "key": "2", "label": "Regular: Hay puntos ciegos relevantes." },
        { "key": "3", "label": "Mal cubiertas o sin sistema: Varias zonas sin cubrir o no hay medios útiles." },
        { "key": "U", "label": "No lo sé" }
      ]
    },
    {
      "id": "C15",
      "block": "P",
      "text": "Si alguien entrara en tu local, ¿en cuánto tiempo habría una reacción real?",
      "help": "Los primeros 5–10 minutos suelen decidir el resultado.",
      "options": [
        { "key": "0", "label": "En menos de 10 minutos." },
        { "key": "1", "label": "Entre 10 y 20 minutos." },
        { "key": "2", "label": "Entre 20 y 40 minutos." },
        { "key": "3", "label": "Más de 40 minutos o probablemente nadie a tiempo." },
        { "key": "U", "label": "No lo sé" }
      ]
    }
  ],

  "alignment": {
    "expected_ids": {
      "vivienda": ["V01","V02","V03","V04","V05","V06","V07","V08","V09","V10","V11","V12","V13","V14","V15"],
      "comercio": ["C01","C02","C03","C04","C05","C06","C07","C08","C09","C10","C11","C12","C13","C14","C15"]
    },
    "block_by_id": {
      "V01": "S", "V02": "E", "V03": "E", "V04": "R", "V05": "R", "V06": "R",
      "V07": "D", "V08": "D", "V09": "D", "V10": "P", "V11": "P", "V12": "P",
      "V13": "H", "V14": "H", "V15": "T",

      "C01": "S", "C02": "T", "C03": "T", "C04": "E", "C05": "E", "C06": "E",
      "C07": "R", "C08": "R", "C09": "R", "C10": "H", "C11": "H", "C12": "H",
      "C13": "D", "C14": "D", "C15": "P"
    }
  }
}
